# Markdown syntax
## heading 2
### heading 3
#### heading 4
##### heading 5
###### heading 6

Machine **learning** programming

[Text displayed](https:www.google.com)

[google](https://www.google.com)

**shortcuts in jupyter notebook**

**shift enter**
    to execute the current cell and go to next cell

**esc a**
    to create new cell above the current cell

**esc b**
    to create new cell below the current cell

**esc dd**
    to delete the current cell

**Machine Learning using python**

1. how to read csv file?

In [3]:
import pandas as pd

In [4]:
# dataframe
df = pd.read_csv('salary.csv')

In [5]:
df

   Experience Salary
0           1  15000
1           2  20000
2           3  25000
3           4   ramu
4           5    NaN
5           6  45000
6           7   5000

How many rows and columns in my dataframe?

In [6]:
df.shape

(7, 2)

what are the column names?

In [7]:
df.columns

Index(['Experience', 'Salary'], dtype='object')

is there any missing values in df?

In [8]:
df

   Experience Salary
0           1  15000
1           2  20000
2           3  25000
3           4   ramu
4           5    NaN
5           6  45000
6           7   5000

In [9]:
df.isna().sum()

Experience    0
Salary        1
dtype: int64

remove the missing value rows

In [11]:
df.dropna()

   Experience Salary
0           1  15000
1           2  20000
2           3  25000
3           4   ramu
5           6  45000
6           7   5000

In [12]:
df.fillna(111)

   Experience Salary
0           1  15000
1           2  20000
2           3  25000
3           4   ramu
4           5    111
5           6  45000
6           7   5000

In [13]:
df.drop(3)

   Experience Salary
0           1  15000
1           2  20000
2           3  25000
4           5    NaN
5           6  45000
6           7   5000